apache/nuttx/arch/arm/src/stm32c5/hardware/stm32c5xx_rcc.h
#define RCC_AHB1RSTR_RESET          0x00000000
#define RCC_AHB1RSTR_LPDMA1RST      (1 << 0)
#define RCC_AHB1RSTR_LPDMA2RST      (1 << 1)
#define RCC_AHB1RSTR_CRCRST         (1 << 12)
#define RCC_AHB1RSTR_CORDICRST      (1 << 14)
#define RCC_AHB1RSTR_RAMCFGRST      (1 << 17)

/* RCC AHB2 peripheral reset register */

#define RCC_AHB2RSTR_RESET          0x00000000
#define RCC_AHB2RSTR_GPIOARST       (1 << 0)
#define RCC_AHB2RSTR_GPIOBRST       (1 << 1)
#define RCC_AHB2RSTR_GPIOCRST       (1 << 2)
#define RCC_AHB2RSTR_GPIODRST       (1 << 3)
#define RCC_AHB2RSTR_GPIOERST       (1 << 4)
#define RCC_AHB2RSTR_GPIOHRST       (1 << 7)
#define RCC_AHB2RSTR_ADC12RST       (1 << 10)
#define RCC_AHB2RSTR_DAC1RST        (1 << 11)
#define RCC_AHB2RSTR_AESRST         (1 << 16)
#define RCC_AHB2RSTR_HASHRST        (1 << 17)
#define RCC_AHB2RSTR_RNGRST         (1 << 18)

/* RCC APB1 peripheral low reset register */

#define RCC_APB1LRSTR_RESET         0x00000000
#define RCC_APB1LRSTR_TIM2RST       (1 << 0)
#define RCC_APB1LRSTR_TIM5RST       (1 << 3)
#define RCC_APB1LRSTR_TIM6RST       (1 << 4)
#define RCC_APB1LRSTR_TIM7RST       (1 << 5)
#define RCC_APB1LRSTR_TIM12RST      (1 << 6)
#define RCC_APB1LRSTR_OPAMP1RST     (1 << 13)
#define RCC_APB1LRSTR_SPI2RST       (1 << 14)
#define RCC_APB1LRSTR_SPI3RST       (1 << 15)
#define RCC_APB1LRSTR_USART2RST     (1 << 17)
#define RCC_APB1LRSTR_USART3RST     (1 << 18)
#define RCC_APB1LRSTR_UART4RST      (1 << 19)
#define RCC_APB1LRSTR_UART5RST      (1 << 20)
#define RCC_APB1LRSTR_I2C1RST       (1 << 21)
#define RCC_APB1LRSTR_I2C2RST       (1 << 22)
#define RCC_APB1LRSTR_I3C1RST       (1 << 23)
#define RCC_APB1LRSTR_CRSRST        (1 << 24)

/* RCC APB1 peripheral high reset register */

#define RCC_APB1HRSTR_RESET         0x00000000
#define RCC_APB1HRSTR_COMP12RST     (1 << 3)
#define RCC_APB1HRSTR_FDCANRST      (1 << 9)

/* RCC APB2 peripheral reset register */

#define RCC_APB2RSTR_RESET          0x00000000
#define RCC_APB2RSTR_TIM1RST        (1 << 11)
#define RCC_APB2RSTR_SPI1RST        (1 << 12)
#define RCC_APB2RSTR_TIM8RST        (1 << 13)
#define RCC_APB2RSTR_USART1RST      (1 << 14)
#define RCC_APB2RSTR_TIM15RST       (1 << 16)
#define RCC_APB2RSTR_TIM16RST       (1 << 17)
#define RCC_APB2RSTR_TIM17RST       (1 << 18)
#define RCC_APB2RSTR_USBRST         (1 << 24)

/* RCC APB3 peripheral reset register */

#define RCC_APB3RSTR_RESET          0x00000000
#define RCC_APB3RSTR_SBSRST         (1 << 1)
#define RCC_APB3RSTR_LPUART1RST     (1 << 6)
#define RCC_APB3RSTR_LPTIM1RST      (1 << 11)

/* RCC AHB1 peripheral clock register */

#define RCC_AHB1ENR_RESET           0xc0000100
#define RCC_AHB1ENR_LPDMA1EN        (1 << 0)
#define RCC_AHB1ENR_LPDMA2EN        (1 << 1)
#define RCC_AHB1ENR_FLASHEN         (1 << 8)
#define RCC_AHB1ENR_CRCEN           (1 << 12)
#define RCC_AHB1ENR_CORDICEN        (1 << 14)
#define RCC_AHB1ENR_RAMCFGEN        (1 << 17)
#define RCC_AHB1ENR_SRAM2EN         (1 << 30)
#define RCC_AHB1ENR_SRAM1EN         (1 << 31)

/* RCC AHB2 peripheral clock register */

#define RCC_AHB2ENR_RESET           0x00000000
#define RCC_AHB2ENR_GPIOAEN         (1 << 0)
#define RCC_AHB2ENR_GPIOBEN         (1 << 1)
#define RCC_AHB2ENR_GPIOCEN         (1 << 2)
#define RCC_AHB2ENR_GPIODEN         (1 << 3)
#define RCC_AHB2ENR_GPIOEEN         (1 << 4)
#define RCC_AHB2ENR_GPIOHEN         (1 << 7)
#define RCC_AHB2ENR_ADC12EN         (1 << 10)
#define RCC_AHB2ENR_DAC1EN          (1 << 11)
#define RCC_AHB2ENR_AESEN           (1 << 16)
#define RCC_AHB2ENR_HASHEN          (1 << 17)
#define RCC_AHB2ENR_RNGEN           (1 << 18)

/* RCC APB1 peripheral clock register */

#define RCC_APB1LENR_RESET          0x00000000
#define RCC_APB1LENR_TIM2EN         (1 << 0)
#define RCC_APB1LENR_TIM5EN         (1 << 3)
#define RCC_APB1LENR_TIM6EN         (1 << 4)
#define RCC_APB1LENR_TIM7EN         (1 << 5)
#define RCC_APB1LENR_TIM12EN        (1 << 6)
#define RCC_APB1LENR_WWDGEN         (1 << 11)
#define RCC_APB1LENR_OPAMP1EN       (1 << 13)
#define RCC_APB1LENR_SPI2EN         (1 << 14)
#define RCC_APB1LENR_SPI3EN         (1 << 15)
#define RCC_APB1LENR_USART2EN       (1 << 17)
#define RCC_APB1LENR_USART3EN       (1 << 18)
#define RCC_APB1LENR_UART4EN        (1 << 19)
#define RCC_APB1LENR_UART5EN        (1 << 20)
#define RCC_APB1LENR_I2C1EN         (1 << 21)
#define RCC_APB1LENR_I2C2EN         (1 << 22)
#define RCC_APB1LENR_I3C1EN         (1 << 23)
#define RCC_APB1LENR_CRSEN          (1 << 24)

/* RCC APB1 peripheral clock register */

#define RCC_APB1HENR_RESET          0x00000000
#define RCC_APB1HENR_COMP12EN       (1 << 3)
#define RCC_APB1HENR_FDCANEN        (1 << 9)

/* RCC APB2 peripheral clock register */

#define RCC_APB2ENR_RESET           0x00000000
#define RCC_APB2ENR_TIM1EN          (1 << 11)
#define RCC_APB2ENR_SPI1EN          (1 << 12)
#define RCC_APB2ENR_TIM8EN          (1 << 13)
#define RCC_APB2ENR_USART1EN        (1 << 14)
#define RCC_APB2ENR_TIM15EN         (1 << 16)
#define RCC_APB2ENR_TIM16EN         (1 << 17)
#define RCC_APB2ENR_TIM17EN         (1 << 18)
#define RCC_APB2ENR_USBEN           (1 << 24)

/* RCC APB3 peripheral clock register */

#define RCC_APB3ENR_RESET           0x00000000
#define RCC_APB3ENR_SBSEN           (1 << 1)
#define RCC_APB3ENR_LPUART1EN       (1 << 6)
#define RCC_APB3ENR_LPTIM1EN        (1 << 11)
#define RCC_APB3ENR_RTCAPBEN        (1 << 21)

/* RCC AHB1 sleep clock register */

#define RCC_AHB1LPENR_RESET         0xc4025103
#define RCC_AHB1LPENR_LPDMA1LPEN    (1 << 0)
#define RCC_AHB1LPENR_LPDMA2LPEN    (1 << 1)
#define RCC_AHB1LPENR_FLASHLPEN     (1 << 8)
#define RCC_AHB1LPENR_CRCLPEN       (1 << 12)
#define RCC_AHB1LPENR_CORDICLPEN    (1 << 14)
#define RCC_AHB1LPENR_RAMCFGLPEN    (1 << 17)
#define RCC_AHB1LPENR_ICACHELPEN    (1 << 26)
#define RCC_AHB1LPENR_SRAM2LPEN     (1 << 30)
#define RCC_AHB1LPENR_SRAM1LPEN     (1 << 31)

/* RCC AHB2 sleep clock register */

#define RCC_AHB2LPENR_RESET         0x00070c9f
#define RCC_AHB2LPENR_GPIOALPEN     (1 << 0)
#define RCC_AHB2LPENR_GPIOBLPEN     (1 << 1)
#define RCC_AHB2LPENR_GPIOCLPEN     (1 << 2)
#define RCC_AHB2LPENR_GPIODLPEN     (1 << 3)
#define RCC_AHB2LPENR_GPIOELPEN     (1 << 4)
#define RCC_AHB2LPENR_GPIOHLPEN     (1 << 7)
#define RCC_AHB2LPENR_ADC12LPEN     (1 << 10)
#define RCC_AHB2LPENR_DAC1LPEN      (1 << 11)
#define RCC_AHB2LPENR_AESLPEN       (1 << 16)
#define RCC_AHB2LPENR_HASHLPEN      (1 << 17)
#define RCC_AHB2LPENR_RNGLPEN       (1 << 18)

/* RCC APB1 sleep clock register */

#define RCC_APB1LLPENR_RESET        0x01fec879
#define RCC_APB1LLPENR_TIM2LPEN     (1 << 0)
#define RCC_APB1LLPENR_TIM5LPEN     (1 << 3)
#define RCC_APB1LLPENR_TIM6LPEN     (1 << 4)
#define RCC_APB1LLPENR_TIM7LPEN     (1 << 5)
#define RCC_APB1LLPENR_TIM12LPEN    (1 << 6)
#define RCC_APB1LLPENR_WWDGLPEN     (1 << 11)
#define RCC_APB1LLPENR_OPAMP1LPEN   (1 << 13)
#define RCC_APB1LLPENR_SPI2LPEN     (1 << 14)
#define RCC_APB1LLPENR_SPI3LPEN     (1 << 15)
#define RCC_APB1LLPENR_USART2LPEN   (1 << 17)
#define RCC_APB1LLPENR_USART3LPEN   (1 << 18)
#define RCC_APB1LLPENR_UART4LPEN    (1 << 19)
#define RCC_APB1LLPENR_UART5LPEN    (1 << 20)
#define RCC_APB1LLPENR_I2C1LPEN     (1 << 21)
#define RCC_APB1LLPENR_I2C2LPEN     (1 << 22)
#define RCC_APB1LLPENR_I3C1LPEN     (1 << 23)
#define RCC_APB1LLPENR_CRSLPEN      (1 << 24)

/* RCC APB1 sleep clock register */

#define RCC_APB1HLPENR_RESET        0x40000208
#define RCC_APB1HLPENR_COMP12LPEN   (1 << 3)
#define RCC_APB1HLPENR_FDCANLPEN    (1 << 9)

/* RCC APB2 sleep clock register */

