apache/nuttx/arch/arm/src/stm32c5/hardware/stm32c5xx_rcc.h
#define RCC_APB2LPENR_RESET         0x01077800
#define RCC_APB2LPENR_TIM1LPEN      (1 << 11)
#define RCC_APB2LPENR_SPI1LPEN      (1 << 12)
#define RCC_APB2LPENR_TIM8LPEN      (1 << 13)
#define RCC_APB2LPENR_USART1LPEN    (1 << 14)
#define RCC_APB2LPENR_TIM15LPEN     (1 << 16)
#define RCC_APB2LPENR_TIM16LPEN     (1 << 17)
#define RCC_APB2LPENR_TIM17LPEN     (1 << 18)
#define RCC_APB2LPENR_USBLPEN       (1 << 24)

/* RCC APB3 sleep clock register */

#define RCC_APB3LPENR_RESET         0x00200842
#define RCC_APB3LPENR_SBSLPEN       (1 << 1)
#define RCC_APB3LPENR_LPUART1LPEN   (1 << 6)
#define RCC_APB3LPENR_LPTIM1LPEN    (1 << 11)
#define RCC_APB3LPENR_RTCAPBLPEN    (1 << 21)

/* RCC kernel clock configuration register */

#define RCC_CCIPR1_RESET            0x00000000
#define RCC_CCIPR1_USART1SEL_SHIFT  (0)
#define RCC_CCIPR1_USART1SEL_MASK   (0x3 << RCC_CCIPR1_USART1SEL_SHIFT)
#define RCC_CCIPR1_USART1SEL(n)     ((n) << RCC_CCIPR1_USART1SEL_SHIFT)
#define RCC_CCIPR1_USART1SEL_PCLK2 RCC_CCIPR1_USART1SEL(0)
#define RCC_CCIPR1_USART1SEL_PSIK  RCC_CCIPR1_USART1SEL(1)
#define RCC_CCIPR1_USART1SEL_HSIK  RCC_CCIPR1_USART1SEL(2)
#define RCC_CCIPR1_USART1SEL_LSE   RCC_CCIPR1_USART1SEL(3)
#define RCC_CCIPR1_USART2SEL_SHIFT  (2)
#define RCC_CCIPR1_USART2SEL_MASK   (0x3 << RCC_CCIPR1_USART2SEL_SHIFT)
#define RCC_CCIPR1_USART2SEL(n)     ((n) << RCC_CCIPR1_USART2SEL_SHIFT)
#define RCC_CCIPR1_USART2SEL_PCLK1 RCC_CCIPR1_USART2SEL(0)
#define RCC_CCIPR1_USART2SEL_PSIK  RCC_CCIPR1_USART2SEL(1)
#define RCC_CCIPR1_USART2SEL_HSIK  RCC_CCIPR1_USART2SEL(2)
#define RCC_CCIPR1_USART2SEL_LSE   RCC_CCIPR1_USART2SEL(3)
#define RCC_CCIPR1_USART3SEL_SHIFT  (4)
#define RCC_CCIPR1_USART3SEL_MASK   (0x3 << RCC_CCIPR1_USART3SEL_SHIFT)
#define RCC_CCIPR1_USART3SEL(n)     ((n) << RCC_CCIPR1_USART3SEL_SHIFT)
#define RCC_CCIPR1_USART3SEL_PCLK1 RCC_CCIPR1_USART3SEL(0)
#define RCC_CCIPR1_USART3SEL_PSIK  RCC_CCIPR1_USART3SEL(1)
#define RCC_CCIPR1_USART3SEL_HSIK  RCC_CCIPR1_USART3SEL(2)
#define RCC_CCIPR1_USART3SEL_LSE   RCC_CCIPR1_USART3SEL(3)
#define RCC_CCIPR1_UART4SEL_SHIFT   (6)
#define RCC_CCIPR1_UART4SEL_MASK    (0x3 << RCC_CCIPR1_UART4SEL_SHIFT)
#define RCC_CCIPR1_UART4SEL(n)      ((n) << RCC_CCIPR1_UART4SEL_SHIFT)
#define RCC_CCIPR1_UART4SEL_PCLK1 RCC_CCIPR1_UART4SEL(0)
#define RCC_CCIPR1_UART4SEL_PSIK  RCC_CCIPR1_UART4SEL(1)
#define RCC_CCIPR1_UART4SEL_HSIK  RCC_CCIPR1_UART4SEL(2)
#define RCC_CCIPR1_UART4SEL_LSE   RCC_CCIPR1_UART4SEL(3)
#define RCC_CCIPR1_UART5SEL_SHIFT   (8)
#define RCC_CCIPR1_UART5SEL_MASK    (0x3 << RCC_CCIPR1_UART5SEL_SHIFT)
#define RCC_CCIPR1_UART5SEL(n)      ((n) << RCC_CCIPR1_UART5SEL_SHIFT)
#define RCC_CCIPR1_UART5SEL_PCLK1 RCC_CCIPR1_UART5SEL(0)
#define RCC_CCIPR1_UART5SEL_PSIK  RCC_CCIPR1_UART5SEL(1)
#define RCC_CCIPR1_UART5SEL_HSIK  RCC_CCIPR1_UART5SEL(2)
#define RCC_CCIPR1_UART5SEL_LSE   RCC_CCIPR1_UART5SEL(3)
#define RCC_CCIPR1_LPUART1SEL_SHIFT (14)
#define RCC_CCIPR1_LPUART1SEL_MASK  (0x3 << RCC_CCIPR1_LPUART1SEL_SHIFT)
#define RCC_CCIPR1_LPUART1SEL(n)    ((n) << RCC_CCIPR1_LPUART1SEL_SHIFT)
#define RCC_CCIPR1_LPUART1SEL_PCLK3 RCC_CCIPR1_LPUART1SEL(0)
#define RCC_CCIPR1_LPUART1SEL_HSIK  RCC_CCIPR1_LPUART1SEL(1)
#define RCC_CCIPR1_LPUART1SEL_LSE   RCC_CCIPR1_LPUART1SEL(2)
#define RCC_CCIPR1_LPUART1SEL_LSI   RCC_CCIPR1_LPUART1SEL(3)
#define RCC_CCIPR1_SPI1SEL_SHIFT    (16)
#define RCC_CCIPR1_SPI1SEL_MASK     (0x3 << RCC_CCIPR1_SPI1SEL_SHIFT)
#define RCC_CCIPR1_SPI1SEL(n)       ((n) << RCC_CCIPR1_SPI1SEL_SHIFT)
#define RCC_CCIPR1_SPI1SEL_PCLK2  RCC_CCIPR1_SPI1SEL(0)
#define RCC_CCIPR1_SPI1SEL_PSIK   RCC_CCIPR1_SPI1SEL(1)
#define RCC_CCIPR1_SPI1SEL_HSIK   RCC_CCIPR1_SPI1SEL(2)
#define RCC_CCIPR1_SPI1SEL_AUDIOCLK RCC_CCIPR1_SPI1SEL(3)
#define RCC_CCIPR1_SPI2SEL_SHIFT    (18)
#define RCC_CCIPR1_SPI2SEL_MASK     (0x3 << RCC_CCIPR1_SPI2SEL_SHIFT)
#define RCC_CCIPR1_SPI2SEL(n)       ((n) << RCC_CCIPR1_SPI2SEL_SHIFT)
#define RCC_CCIPR1_SPI2SEL_PCLK1  RCC_CCIPR1_SPI2SEL(0)
#define RCC_CCIPR1_SPI2SEL_PSIK   RCC_CCIPR1_SPI2SEL(1)
#define RCC_CCIPR1_SPI2SEL_HSIK   RCC_CCIPR1_SPI2SEL(2)
#define RCC_CCIPR1_SPI2SEL_AUDIOCLK RCC_CCIPR1_SPI2SEL(3)
#define RCC_CCIPR1_SPI3SEL_SHIFT    (20)
#define RCC_CCIPR1_SPI3SEL_MASK     (0x3 << RCC_CCIPR1_SPI3SEL_SHIFT)
#define RCC_CCIPR1_SPI3SEL(n)       ((n) << RCC_CCIPR1_SPI3SEL_SHIFT)
#define RCC_CCIPR1_SPI3SEL_PCLK1  RCC_CCIPR1_SPI3SEL(0)
#define RCC_CCIPR1_SPI3SEL_PSIK   RCC_CCIPR1_SPI3SEL(1)
#define RCC_CCIPR1_SPI3SEL_HSIK   RCC_CCIPR1_SPI3SEL(2)
#define RCC_CCIPR1_SPI3SEL_AUDIOCLK RCC_CCIPR1_SPI3SEL(3)
#define RCC_CCIPR1_FDCANSEL_SHIFT   (26)
#define RCC_CCIPR1_FDCANSEL_MASK    (0x3 << RCC_CCIPR1_FDCANSEL_SHIFT)
#define RCC_CCIPR1_FDCANSEL(n)      ((n) << RCC_CCIPR1_FDCANSEL_SHIFT)
#define RCC_CCIPR1_FDCANSEL_PCLK1 RCC_CCIPR1_FDCANSEL(0)
#define RCC_CCIPR1_FDCANSEL_PSIS  RCC_CCIPR1_FDCANSEL(1)
#define RCC_CCIPR1_FDCANSEL_PSIK  RCC_CCIPR1_FDCANSEL(2)
#define RCC_CCIPR1_FDCANSEL_HSE   RCC_CCIPR1_FDCANSEL(3)

/* RCC kernel clock configuration register */

#define RCC_CCIPR2_RESET            0x00000000
#define RCC_CCIPR2_I2C1SEL_SHIFT    (0)
#define RCC_CCIPR2_I2C1SEL_MASK     (0x3 << RCC_CCIPR2_I2C1SEL_SHIFT)
#define RCC_CCIPR2_I2C1SEL(n)       ((n) << RCC_CCIPR2_I2C1SEL_SHIFT)
#define RCC_CCIPR2_I2C1SEL_PCLK1  RCC_CCIPR2_I2C1SEL(0)
#define RCC_CCIPR2_I2C1SEL_PSIK   RCC_CCIPR2_I2C1SEL(1)
#define RCC_CCIPR2_I2C1SEL_HSIK   RCC_CCIPR2_I2C1SEL(2)
#define RCC_CCIPR2_I2C2SEL_SHIFT    (2)
#define RCC_CCIPR2_I2C2SEL_MASK     (0x3 << RCC_CCIPR2_I2C2SEL_SHIFT)
#define RCC_CCIPR2_I2C2SEL(n)       ((n) << RCC_CCIPR2_I2C2SEL_SHIFT)
#define RCC_CCIPR2_I2C2SEL_PCLK1  RCC_CCIPR2_I2C2SEL(0)
#define RCC_CCIPR2_I2C2SEL_PSIK   RCC_CCIPR2_I2C2SEL(1)
#define RCC_CCIPR2_I2C2SEL_HSIK   RCC_CCIPR2_I2C2SEL(2)
#define RCC_CCIPR2_I3C1SEL_SHIFT    (6)
#define RCC_CCIPR2_I3C1SEL_MASK     (0x3 << RCC_CCIPR2_I3C1SEL_SHIFT)
#define RCC_CCIPR2_I3C1SEL(n)       ((n) << RCC_CCIPR2_I3C1SEL_SHIFT)
#define RCC_CCIPR2_I3C1SEL_PCLK1  RCC_CCIPR2_I3C1SEL(0)
#define RCC_CCIPR2_I3C1SEL_PSIK   RCC_CCIPR2_I3C1SEL(1)
#define RCC_CCIPR2_I3C1SEL_HSIK   RCC_CCIPR2_I3C1SEL(2)
#define RCC_CCIPR2_ADCDACSEL_SHIFT  (10)
#define RCC_CCIPR2_ADCDACSEL_MASK   (0x3 << RCC_CCIPR2_ADCDACSEL_SHIFT)
#define RCC_CCIPR2_ADCDACSEL(n)     ((n) << RCC_CCIPR2_ADCDACSEL_SHIFT)
#define RCC_CCIPR2_ADCDACSEL_HCLK RCC_CCIPR2_ADCDACSEL(0)
#define RCC_CCIPR2_ADCDACSEL_PSIS RCC_CCIPR2_ADCDACSEL(1)
#define RCC_CCIPR2_ADCDACSEL_PSIK RCC_CCIPR2_ADCDACSEL(2)
#define RCC_CCIPR2_ADCDACSEL_HSIK RCC_CCIPR2_ADCDACSEL(3)
#define RCC_CCIPR2_ADCDACPRE_SHIFT  (12)
#define RCC_CCIPR2_ADCDACPRE_MASK   (0x7 << RCC_CCIPR2_ADCDACPRE_SHIFT)
#define RCC_CCIPR2_ADCDACPRE(n)     ((n) << RCC_CCIPR2_ADCDACPRE_SHIFT)
#define RCC_CCIPR2_DACSEL           (1 << 15)
#define RCC_CCIPR2_DACSEL_LSE     (0)
#define RCC_CCIPR2_DACSEL_LSI     RCC_CCIPR2_DACSEL
#define RCC_CCIPR2_LPTIM1SEL_SHIFT  (16)
#define RCC_CCIPR2_LPTIM1SEL_MASK   (0x3 << RCC_CCIPR2_LPTIM1SEL_SHIFT)
#define RCC_CCIPR2_LPTIM1SEL(n)     ((n) << RCC_CCIPR2_LPTIM1SEL_SHIFT)
#define RCC_CCIPR2_LPTIM1SEL_PCLK3 RCC_CCIPR2_LPTIM1SEL(0)
#define RCC_CCIPR2_LPTIM1SEL_HSIK  RCC_CCIPR2_LPTIM1SEL(1)
#define RCC_CCIPR2_LPTIM1SEL_LSE   RCC_CCIPR2_LPTIM1SEL(2)
#define RCC_CCIPR2_LPTIM1SEL_LSI   RCC_CCIPR2_LPTIM1SEL(3)
#define RCC_CCIPR2_CK48SEL_SHIFT    (24)
#define RCC_CCIPR2_CK48SEL_MASK     (0x3 << RCC_CCIPR2_CK48SEL_SHIFT)
#define RCC_CCIPR2_CK48SEL(n)       ((n) << RCC_CCIPR2_CK48SEL_SHIFT)
#define RCC_CCIPR2_CK48SEL_PSIDIV3 RCC_CCIPR2_CK48SEL(1)
#define RCC_CCIPR2_CK48SEL_HSIDIV3 RCC_CCIPR2_CK48SEL(2)
#define RCC_CCIPR2_CK48SEL_HSE     RCC_CCIPR2_CK48SEL(3)
#define RCC_CCIPR2_SYSTICKSEL_SHIFT (30)
#define RCC_CCIPR2_SYSTICKSEL_MASK  (0x3 << RCC_CCIPR2_SYSTICKSEL_SHIFT)
#define RCC_CCIPR2_SYSTICKSEL(n)    ((n) << RCC_CCIPR2_SYSTICKSEL_SHIFT)
#define RCC_CCIPR2_SYSTICKSEL_HCLK8 RCC_CCIPR2_SYSTICKSEL(0)
#define RCC_CCIPR2_SYSTICKSEL_LSI   RCC_CCIPR2_SYSTICKSEL(1)
#define RCC_CCIPR2_SYSTICKSEL_LSE   RCC_CCIPR2_SYSTICKSEL(2)

/* RCC RTC domain control register */

#define RCC_RTCCR_RESET             0x00000000
#define RCC_RTCCR_LSEON             (1 << 0)
#define RCC_RTCCR_LSERDY            (1 << 1)
#define RCC_RTCCR_LSEBYP            (1 << 2)
#define RCC_RTCCR_LSEDRV_SHIFT      (3)
#define RCC_RTCCR_LSEDRV_MASK       (0x3 << RCC_RTCCR_LSEDRV_SHIFT)
#define RCC_RTCCR_LSEDRV(n)         ((n) << RCC_RTCCR_LSEDRV_SHIFT)
#define RCC_RTCCR_LSEDRV_LOW      RCC_RTCCR_LSEDRV(0)
#define RCC_RTCCR_LSEDRV_MEDLOW   RCC_RTCCR_LSEDRV(1)
#define RCC_RTCCR_LSEDRV_MEDHIGH  RCC_RTCCR_LSEDRV(2)
#define RCC_RTCCR_LSEDRV_HIGH     RCC_RTCCR_LSEDRV(3)
#define RCC_RTCCR_LSECSSON          (1 << 5)
#define RCC_RTCCR_LSECSSD           (1 << 6)
#define RCC_RTCCR_LSEEXT            (1 << 7)
#define RCC_RTCCR_RTCSEL_SHIFT      (8)
#define RCC_RTCCR_RTCSEL_MASK       (0x3 << RCC_RTCCR_RTCSEL_SHIFT)
#define RCC_RTCCR_RTCSEL(n)         ((n) << RCC_RTCCR_RTCSEL_SHIFT)
#define RCC_RTCCR_RTCSEL_NONE     RCC_RTCCR_RTCSEL(0)
#define RCC_RTCCR_RTCSEL_LSE      RCC_RTCCR_RTCSEL(1)
#define RCC_RTCCR_RTCSEL_LSI      RCC_RTCCR_RTCSEL(2)
#define RCC_RTCCR_RTCSEL_HSE      RCC_RTCCR_RTCSEL(3)
#define RCC_RTCCR_RTCEN             (1 << 15)
#define RCC_RTCCR_RTCDRST           (1 << 16)
#define RCC_RTCCR_LSCOEN            (1 << 24)
#define RCC_RTCCR_LSCOSEL           (1 << 25)
#define RCC_RTCCR_LSCOSEL_LSI     (0)
#define RCC_RTCCR_LSCOSEL_LSE     RCC_RTCCR_LSCOSEL
#define RCC_RTCCR_LSION             (1 << 26)
#define RCC_RTCCR_LSIRDY            (1 << 27)

/* RCC reset status register */

#define RCC_RSR_RESET               0x00000000
#define RCC_RSR_RMVF                (1 << 23)
#define RCC_RSR_PINRSTF             (1 << 26)
#define RCC_RSR_BORRSTF             (1 << 27)
#define RCC_RSR_SFTRSTF             (1 << 28)
#define RCC_RSR_IWDGRSTF            (1 << 29)
#define RCC_RSR_WWDGRSTF            (1 << 30)
#define RCC_RSR_LPWRRSTF            (1 << 31)

/* RCC privilege configuration register */

#define RCC_PRIVCFGR_RESET          0x00000000
#define RCC_PRIVCFGR_PRIV           (1 << 1)

#endif /* __ARCH_ARM_SRC_STM32C5_HARDWARE_STM32C5XX_RCC_H */
